[
  {
    "hash": "0x3b3a157b5168364e25c10611af65668bed5d8fbb",
    "book_title": "The Geek Way",
    "book_author": "Andrew McAfee",
    "text": "Day one, review one: The Geek Way\n\nIt’s well articulated, it’s by an industry-adjacent person, and it’s pro tech. \n\nBut it’s not going to surprise anyone already steeped in startup culture. \n\nIt advises a four prong recipe for building a successful company culture:\n\n- make data driven decisions \n- promote agency/ownership\n- move fast\n- be super open\n\nIf you’re looking at that and going “hell yeah” then it’s safe to skip this one. \n\nBut it’d be a good handbook for teaching newcomers and outsiders. And it’d make a great passive aggressive birthday gift for a cofounder who thinks his “Steve Jobs level product intuition” trumps your “AB testing data”\n\nFour stars for its type, a solid 101 on healthy tech company culture",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x798a6065c3fe6eea9cfd354a7a8463a0c0c2cbc2",
    "book_title": "Cod",
    "book_author": "Mark Kurlansky",
    "text": "Day two: Cod \n\nIt’s hard to credibly convey how compelling Kurlansky’s books are, given the seemingly dull subject matter. The prose is merely fair, but the research is  impeccable and he mixes colorful illustrative anecdotes in at the perfect pace.\n\nMy then 5yo never lost interest, which is strong testimony. Four stars for its type. \n\nHis books on salt and onions are also worth reading. For the sake of calibration, I’d cite At Home and The Mother Tongue by Bill Bryson as five star examples of the class.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xa3324b5f0acf0e3764d9aad9dd049203652f146c",
    "book_title": "Master and Commander",
    "book_author": "Niall Ferguson",
    "text": "Day four: Master and Commander\n\nOne of the all time heavyweight champions of historical fiction. Bill Bryson calls it his favorite escapist reading. Keith Richards shouts it out at the end of his book Life.\n\nThere are a bunch of red flags on this book for me:\n- this book is the first in a series of 20\n- it’s a historical seafaring adventure\n- it was written in the 60s but uses period language\n- it’s laden with esoteric jargon\n\nGiven the red flags, I expected a cheap swashbuckling novel hiding its poor writing behind unfamiliar language. But the exact opposite is the case. The whole series is outstanding.\n\nThe prose is excellent, once you get your head into it. The character development is first rate and continues throughout the series. The stories are subtle and nuanced in a way you’d never expect from historical military fiction.\n\nO’Brian is the John Williams of his niche. You’d never mention them in the same breath as confirmed masters like Beethoven or Jane Austen, but we should.\n\nFive stars easy",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x6243c3aee15ec6916d540952dcc30f9a4fc1dce8",
    "book_title": "War",
    "book_author": "Sebastian Junger",
    "text": "Day six: War by Sebastian Junger\n\nMy favorite war book of all time. \n\nI’ve never been in a war or anywhere near one, so take it with a grain of salt. But you can’t talk about this book without praising its realism. At the very least, any civilian should be able to recognize a believably complicated picture of humanity’s relationship with war. \n\nYeah, war’s bad and miserable of course. But for the young men standing behind the weapons and hoping the enemy bullets miss them, it’s also peerlessly exciting. \n\nThe book is full of great characters, memorable scenes, captivating detail, excellent writing, and a surprising amount of comic relief. Fans of Sebastian Junger will recognize his familiar role of narrator/character taken to its pinnacle. \n\nThere’s also a pair of great documentaries to go with it. \n\nIf you only ever read one book about war, read this one. \n\n5/5 no notes",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x35257fd4a4234ba6d69a6ea6d6d4b29e36ca954f",
    "book_title": "Freedom",
    "book_author": "Sebastian Junger",
    "text": "Day seven: Freedom by Sebastian Junger\n\nNot his strongest work, but not bad. \n\nExplicitly, it’s a story of a weird, long hike he took with some friends interspersed with characteristically well researched and written information about, well… freedom. \n\nIt was most enjoyable for me as the implicit story of his midlife crisis. He was clearly in a weird place emotionally. I suspect he was processing some actual PTSD from the War days and also probably feeling a bit uncomfortable about having achieved such success on such a sensitive topic. You get the feeling he was trying to recreate the feeling of being part of a small, fiercely cohesive, tightly aligned group as a form of therapy. Or at least as a hit of his preferred drug. \n\nIt’s a relatively weak point in his bibliography and I suggest Tribe instead as a direct comparable. And don’t go digging deep into the minor titles at all until you’ve read the Perfect Storm and War. \n\nThree stars by Sebastian Junger standards.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x589030e48f2e7a9c7a30ab9de392d4597de7ddd8",
    "book_title": "The Things They Carried",
    "book_author": "Tim O’Brien",
    "text": "Day eight: The Things They Carried \n\nThis was my first reread since I was a teenager and I’m pleased to report that it holds up. The writing is excellent and the stories hit like one ton of bricks after another. \n\nIts posture towards war is right down the middle. Not as willing to address the special bonding or moments of excitement as War by Junger. But doesn’t treat it as a series of unmitigated miseries like All Quiet on the Western Front. \n\nIt does a good job of looking fear and shame in the face, in the tradition of Red Badge of Courage. But it also has one of the best lines about courage ever written. To paraphrase: it’s a muscle you build, not a hoard you store up to draw down when you need it. \n\nThis is tenth grade English teachers’ favorite book to assign for good reason. Great writing, great storytelling, universally accessible. Five stars.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x688d88829f6e4a5a8a7f094027dce2213d57265d",
    "book_title": "The Ancient City",
    "book_author": "Niall Ferguson",
    "text": "Day nine: The Ancient City\n\nAn incredible portrait of life in ancient times, centered around how early religion grew into early civic life. \n\nIf you think about the Roman Empire every day and you haven’t read this yet, you should treat yourself. \n\nIt’s so juicy and homey compared to the sanitized and streamlined histories of wars and large scale politics. \n\nI keep multiple copies in my house to give away so that I don’t end up losing my personal copy. \n\nThe most vivid and human look at life in classical Greece and Rome. Pound for pound my favorite book on ancient times. \n\nFive stars. Keep the home fire burning 🫡",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xae25aa21b424ff2c133598fc0010cc1cbcb9b118",
    "book_title": "The Age of Gold",
    "book_author": "H. W. Brands",
    "text": "Day 11: The Age of Gold \n\nThis was great fun. The writing is good, it’s packed with exciting adventure, and it’s got enough history to feel substantial.\n\nMore than I expected, a lot of it echoes the tech industry: the frenetic energy, SF as the center of the universe, cycles of boom and bust. Even the $10 cups of coffee. \n\nIt’s the early history of California through the lens of gold prospecting, but it’s also a set of warnings about our own time. \n\nIf you’re new to the Bay Area, I especially recommend reading this. Even if you’re not, it’s worth adding to your list. It’d make a great book for an international flight. If nothing else, it’ll make you grateful that you don’t have to cross the Darien Gap on foot. \n\nFour stars for its type, but only because its type is so stacked.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x8fa7ff3967cc0a770f59f009e1edf826a15bf0e0",
    "book_title": "Dispatches",
    "book_author": "Tim O’Brien",
    "text": "Day 12: Dispatches \n\nA semi-cohesive collection of spectacular gonzo flavored Vietnam War semi-journalism. \n\nChaotic neutral on the war book alignment chart. The author worked on the scripts for Apocalypse Now and Full Metal Jacket and this book has a lot of that energy. \n\nIt also created lot of the vibe and a lot of the tropes that show up consistently in other Vietnam War movies. \n\nIt’s heavy on absurdity and you constantly feel like anything could happen, but it never gets too disorienting. If you read it in a single sitting, you’d spend the next week talking like Dennis Hopper’s character from Apocalypse Now. \n\nFive stars. Definitive work",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x4204610e7fc35daa6adcbdcd7c6321619399ee8f",
    "book_title": "When Breath Becomes Air",
    "book_author": "Paul Kalanithi",
    "text": "Day 15: When Breath Becomes Air\n\nA neurosurgeon reflects on the meaning of life as he approaches death. What could be bad about that, right? Such poignant irony! Such perspective!\n\nWhen I plucked this off of my wife’s section of the bookshelf, that’s what was running through my head.\n\n“Great, I’ll read it and then my wife and I can talk about it together!”\n\nSo I’m psyched. I love books about death. I love reading books by super smart people. I get settled in and start reading.\n\nIt quickly becomes clear to me that I’m reading a collection of essays, panicked diary entries, and dollar store philosophical ramblings. Apparently the editors, without a living author to work with, decided to just ship it as they found it.\n\nIf Kalanithi had made a miraculous recovery, he’d have reread this, realized that it’s sentimental hallmark movie slop, and tucked it in the drawer where it belongs.\n\nI went to my wife to say all this. Her response: “Oh yeah, never read it.”\n\nTwo stars. Don’t fall for it.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x0408f5c582fc751f119bc135b870228e2ae0cfde",
    "book_title": "The Jungle Book",
    "book_author": "R. Kipling",
    "text": "Day 17: The Jungle Book \n\nA series of fable-ish stories mostly populated by animal characters, including a bunch that don’t star Mowgli. \n\nThe Mowgli stories are the best known for good reason. The Rikki-Tikki-Tavi story is the second strongest. The rest are good but not noteworthy. \n\nMy 6yo and I both had a pretty tepid reaction to it. If you’re out of content to read with your kids, go for it. But here are some alternatives I’d recommend more strongly:\n\nBetter orphan story: The Graveyard Book\n\nBetter animal story: Watership Down\n\nBetter adventure: Treasure Island \n\nBetter Kipling: Captains Courageous \n\nFour stars carried on Mowgli’s little man cub back",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xfb8df897479d3dbb599baf3c22b27e53a4a3aa09",
    "book_title": "The Magic Mountain",
    "book_author": "Thomas Mann",
    "text": "Day 18: The Magic Mountain \n\nA novel about time, illness, death, and the fight for the spirit of Europe. \n\nIf you pick this up, you better be prepared to put your ass into it. Superficially, it’s ~1000 pages of the petty squabbles of affluent Europeans in a sanitorium. But it’s one of those books that professors love where actively decoding it transforms the experience. \n\nI read it primarily because Joseph Campbell treats it as a peer to Ulysses in Creative Mythology. It falls well short of that mark. \n\nYou probably already know if you should read this. If you’re uncertain, read something else. \n\nI’m going to reject its classification as great modern literature and I’m still going to give it only three stars for its class. I did the interpretive work and it still fell flat for me. \n\nIf you loved it, please reply to convince me that I’m a phillistine. Until then, I maintain that the only reason to profess fondness for it is to impress others who also think they’re supposed to like it.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x1cd250023a07ca043d2d132dd54de65a32ddd32a",
    "book_title": "Red Rising",
    "book_author": "James Dashner",
    "text": "Red Rising\n\nOppressed poor boy who’s Ackchyually Super Awsome sneaks into the rich kids’ hunger games summer camp. He sees through the meta, crushes the game, and gets the girl, even though she’s not as good as his old ride or die poor girl.\n\nThe writing at the end is mediocre, which comes as a huge relief after the atrocious writing at the beginning. The author was apparently figuring out how to write in real time over the course of drafting the book. God awful prose, even by the most tolerant standards. \n\nThe storytelling, as distinct from the language itself, is passable, if unimaginative. The character development is laughable. The thesis is exhausted, the tropes are threadbare, and the relationships are entirely implausible. \n\nAbsolute slop, a waste of attention, almost no redeeming qualities. \n\nMy 5yo loved it. \n\nTwo stars, only because I have a soft spot for Battle Royale stories.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xc5a37d60a560b68a77ba5ae09e885be1521c1988",
    "book_title": "Chaos Monkeys",
    "book_author": "Antonio G.",
    "text": "Chaos Monkeys\n\nOur own @antonio tells the story of his journey from square job to startup job to founder to acquired by FAANG. Plus, a lot of personal life hijinks. \n\nThe most important point is that he can actually write. He also knows the industry firsthand. \n\nThe book does a good job of avoiding both vapid tech industry boosterism and groundless anti tech vitriol. \n\nIn other words, it paints a fair, high res picture of our industry. That, plus its consistently irreverent humor, makes it a rare work indeed. \n\nFive stars for its class.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xc32ce356fccb563dcdc70273c0c0e16407400cb2",
    "book_title": "The Optimist",
    "book_author": "David Coggins",
    "text": "The Optimist\n\nDavid Coggins tells a series of fishing stories. \n\nI read five books about fishing in 2024 and instead of rating them out of five stars I’m just going to rank them. They’re all passable if you’re into fly fishing.\n\nTrout Bum\nThe Longest Silence\nLords of the Fly\nThe Optimist\nThe Believer \n\nI fished over 100 days in 2024, all with a fly rod. I don’t show it in this persona, but I am a hardcore fisherman. And if you have been following this series of reviews, you know I’m a hardcore reader. \n\nFishing, especially fly fishing, has layers and layers of esoteric strata. David Coggins writes capably, but it’s clear that he’s essentially a wash ashore to the land of fishing. \n\nIf you’re a filthy casual or if you fish with conventional tackle and you’re curious about fly fishing, this might be a better pick for you. For me, there were too many cases where his explicit assertions about dedication to fishing sounded dissonant against the implicit revelation that he’s not.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xfbef28e59f3f333194b8f7ca89b390953d4bdef0",
    "book_title": "The Believer",
    "book_author": "David Coggins",
    "text": "The Believer\n\nDavid Coggins extends The Optimist by a few hundred pages. \n\nHis writing is still good, and his devotion to fishing increased. \n\nBut still, these are not great fishing devotionals. \n\nEven if you love fishing and have never surfed, read Barbarian Days instead of these.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xe36a1e9843a800b5a1dedb449769cbf62d39c74f",
    "book_title": "The Secret History of Christmas",
    "book_author": "Bill Bryson",
    "text": "The Secret History of Christmas \n\nBill Bryson assembles a few hours of impeccably researched information and personal anecdotes about Christmas. \n\nAs always, the writing is pitch perfect and laugh out loud funny. \n\nIt’s only available as an audiobook read by Bryson, which is a minor demerit in itself but also because Bryson is a middling reader. \n\nI don’t especially like Christmas but I could read Bill Bryson on any subject. Actuarial science? Sign me up. The use of slide rules in the age of calculators? I’m there. But for those of you who get way into Christmas, don’t miss this. \n\nIt especially shines when it’s looking at the different traditions of nations. \n\nFour stars by Bryson standards.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xed5bc43c9ef573ce608b2d256aa047e98b2524a3",
    "book_title": "Skunk Works",
    "book_author": "Ben Rich",
    "text": "Skunk Works \n\nThe story of Lockheed’s justifiably fetishized engineering A team as told by the man who ran it. \n\nLet me start by saying that this book is fun. Spellbinding even.\n\nBut it’s also a piece of critical education on how to get shit done inside a behemoth bureaucracy. In short: split off a group of the top performers, give them important tasks, and install a leader at the top who insulates them from the rest of the organization’s bullshit. \n\nLockheed churned out a parade of the greatest hits of military aviation with this approach (p38, U2, sr71, etc). And the whole startup scene applies roughly the same model to solving tech problems. A good startup is, itself, like a Skunk Works. \n\nIt has just enough aeronautical engineering to give it an exotic flavor without bogging it down. Ben Rich tells just the right number of stories about the planes’ exploits in the world to make you feel how high the stakes were. \n\nIt’s even better than you’d imagine. Five stars for its class.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x219c1188b0bff17df97ba5f28cb9b2a0ce7ce004",
    "book_title": "Kelly: More Than My Share of It All",
    "book_author": "Kelly Johnson",
    "text": "Kelly: More Than My Share of It All\n\nKelly Johnson tells his story, focusing on his time running Lockheed’s vaunted Skunk Works.\n\nThis is a full autobiography, not just a memoir of his Skunk Works days, but it’s all captivating. The meat of it covers the birth of Skunk Works up until the handoff to Ben Rich.\n\nIf you’re planning on reading both (you should!), read this one first. If you’re only going to read one, read Ben Rich’s Skunk Works.\n\nOne of the strongest markers of Skunk Works’ magic is that it worked at peak level under two different leaders. Had it thrived only under one or the other, I’d chalk it up as attributable to the influence of a charismatic leader. But surviving the transition of power reveals an influential team culture independent of leadership. So read both books. \n\nThis book is heavier on human interest stuff than Ben Rich’s, and if you’re a sucker for stories about Depression kids making big impacts, you’ll love it, even if you’re not into aviation.\n\nFive stars",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x8f926cee3103dc9db81c92ef652ed4c3f5f40186",
    "book_title": "Hillbilly Elegy",
    "book_author": "J.D. Vance",
    "text": "Hillbilly Elegy\n\nA kid grows up in a poor, dysfunctional family and somehow makes it into Yale. \n\nMy wife, a devoted memoir reader, read this when it came out and hated it. The only books we’ve ever mutually loved have Harry Potter in the title, so this was a positive signal for me. \n\nTurned out there wasn’t much to love nor much to hate in my experience. The writing was respectable but not remarkable. The story was familiar for those of us who grew up in socioeconomically analogous communities. Same with its insights—nothing too surprising. That is, unless you’re a coastal elite in a bubble, and then it apparently blows your mind. \n\nFor a directly comparable masterpiece of the genre, read The Glass Castle. For a similar story with different textures, read Angela’s Ashes or This Boy’s Life. \n\nThree stars for its class, mostly unexceptional.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xa500f6150ac6369a878b005b8e1d9d18b35557a6",
    "book_title": "Tribe",
    "book_author": "Sebastian Junger",
    "text": "Tribe\n\nSebastian Junger posits that the cure for modern ennui is fierce loyalty and intense belonging in a small, tight knit group.\n\nThe thesis of the book starts with the assumption that people are miserable despite society’s fabulous wealth. He’s such a good writer that I have to actively remind myself to query whether that’s even true.\n\nBut hey, buy the ticket, take the ride. Assuming it is true, he asserts that the reason for the misery is a lack of belonging and purpose. He cites as evidence the fact that people sometimes miss wars and fondly remember crises, because situations like those force us into tribes. You need to be willing to die for someone else for life to have meaning, he asserts.\n\nRegardless of whether the whole line of reasoning holds up, his prescription is a good one: double down on loyalty and dedication to your people to make yourself happier. \n\nGo call your mom, partner, kids, whatever. Tell them Sebastian Junger sent you.\n\nThree stars by SJ standards. High bar; worth reading!",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x0e2bf7f2a78da25ffba315b21ef92dd94956d359",
    "book_title": "In My Time of Dying",
    "book_author": "Sebastian Junger",
    "text": "In My Time of Dying\n\nSebastian Junger comes within spitting distance of death, and writes a book about it. \n\nIt’s especially fun to read it in the context of his other books. All the uncertainty about meaning and purpose that came through in Tribe and Freedom evaporates in the face of death. \n\nHe spends more time talking about his family in this book than in the rest combined, which I suspect is not a coincidence. He’s always had a knack for making readers sympathetically feel things deeply, and clearly the near death experience shook him to his core. \n\nHe gets a bit squirrelly about theories of supernatural experience, but as always, his storytelling, writing, and research are amazing. Even the opening anecdote about cold water surfing sticks in my mind. \n\nIf you like SJ or books about death, this is essential reading. If not, I recommend it nonetheless. \n\nFour stars by SJ standards.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x83cf730b49c1355c0cf83819dbe3a6ed0342ee95",
    "book_title": "The Wright Brothers",
    "book_author": "David McCullough",
    "text": "The Wright Brothers\n\nDavid McCullough documents the Wright brothers’ engineering triumph. \n\nThe book does justice to its story, and the story is every bit as good as one would hope, given the technical and cultural impact of flight. \n\nI especially liked the parts about their time in Kitty Hawk, which was more or less wilderness at that point. \n\nMcCullough also does a great job dispelling the myth that the Wright brothers were simple mechanics who tinkered their way to success. They were serious businessmen, serious engineers, and serious scientists. They also possessed a species of focus and drive that we now associate with successful founders. \n\nI never realized how slow the world was to accept the reality of the Wright Flyer. It was such a different world back then. \n\nStrongly recommended. This and Bill Bryson’s 1927 book would make a great one-two punch. \n\nFive stars for its class.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xce04f3f96bb416f566d9e6508d24f4fd8b5e394e",
    "book_title": "The River of Doubt",
    "book_author": "Hiram Bingham",
    "text": "The River of Doubt\n\nMillard tells the story of TR’s ill fated trip into the Amazon.\n\nThe story itself is great. The book is full of interesting characters. But the storytelling does justice to neither, and the book falls flat.\n\nIt’s at its best just reciting a litany of jungle horrors.\n\nTwo stars for its class.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x53a878f09fe0b2db28a3a499e049494aa9ebae45",
    "book_title": "Angela’s Ashes",
    "book_author": "Frank McCourt",
    "text": "Angela’s Ashes\n\nFrank McCourt tells the story of growing up in a poor, dysfunctional family in Brooklyn and Limerick. \n\nThe author’s grace, humor, and empathy elevate this book above the standard crop of poverty porn memoirs, even those that share its S tier writing and storytelling. \n\nIt’s mystifying to me how someone could so effectively convey that much pathos, despite having clearly matured and recovered so completely. \n\nBut somehow he manages to, and the result for the reader is that you feel McCourt’s pain deeply, but without the emotional hangover that often accompanies this type of book. \n\nI think part of it is that the Irish as a culture are especially well equipped to process sadness and misery. But there’s something singular about McCourt, even in that cultural context. \n\nYour heart breaks as you see Frank coming to understand his dad’s “odd manner,” but you don’t feel like offing yourself after. \n\nThe audiobook is read by McCourt, strongly recommended.\n\nFive stars, a masterpiece.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xb4ace418cf12ca77cef7e5f0614356acdb9aafeb",
    "book_title": "The Inimitable Jeeves",
    "book_author": "PG Wodehouse",
    "text": "The Inimitable Jeeves\n\nPG Wodehouse stitches a bunch of inane short stories into an insufferable novel. \n\nQuoting from my contemporaneous review:\n\n“Just the worst. If you’re the type of person who laughs by turning down the corners of your mouth, lifting your chin, and pushing small chuckles from deep in your throat out of your nose, you might find something to like here. No likable or interesting characters, no development, no unifying story. Just more or less detached episodes of obnoxious people getting into silly, boring situations. The writing is nowhere near as good as its reputation suggests.”\n\nI stand by that. I will add as additional flavor that this was the end of my run of mining Paul Graham’s book recommendations. \n\nNot good, not funny, not worth reading.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x5ae870df86c3309e02e14fb24b698cca89c0f205",
    "book_title": "Ireland",
    "book_author": "Frank Delaney",
    "text": "Ireland \n\nFrank Delaney tells the history of Ireland through a series of fictional stories. \n\nThis is like a kids’ illustrated book, except instead of actual drawings it has interwoven fictional stories to hold adults’ interest across 650 pages of genuine history. \n\nThe frame tale is compelling enough to keep everything feeling unified, all the way from the ice age to Ireland’s bloody twentieth century. \n\nThe stories inside the frame are packed with Irish history, myth, character. \n\nIt’s an agreeable way to learn a whole bunch of Irish history. The audiobook does justice to the Irish oral storytelling tradition. \n\nI’ve never read a book quite like this, so right now it’s alone in its class. Read it if you’re visiting Ireland or going through one of those phases where you’re excited about your Irish heritage.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xb53f02ebbb3f099fdc21fbcf44cd26450a4e0b18",
    "book_title": "Nausea",
    "book_author": "Albert Camus",
    "text": "Nausea\n\nSartre tells a sad and miserable story about a sad and miserable man. \n\nThis book, in its way, is one of the most puritanical and life-denying books I’ve ever read. It’s like something written by a moody, depressive, precocious teenager. \n\nThe protagonist is bored and boring, and instead of doing something, he doubles down on his misery, wallowing around in solipsistic thought loops that make him even more miserable. \n\nAnd the entire time, there’s this self satisfied smirking undertone as if the protagonist, the author, and any sufficiently sensitive reader will know that this is really the best—the only!—way to live. \n\nExistence is not hard to cope with and meaning is not hard to manufacture, even if it doesn’t smack you in the face when you walk out the door. \n\nA sad, stupid, boring book that is overdue to be forgotten. \n\nOne star, skip it.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xfc8c5faee5484d8170df7159036259fb8350acd5",
    "book_title": "The Core of an Onion",
    "book_author": "Mark Kurlansky",
    "text": "The Core of an Onion\n\nMark Kurlansky looks at the cultural and culinary history of the onion. \n\nIf you haven’t read Kurlansky before, it’s hard to believe that a book about a commodity could be so interesting. \n\nIt’s surprisingly dynamic. He moves quickly from one well researched topic to another, but you never get the feeling that he’s wedging something in just to fill space or just because he went to the trouble of researching it. It’s everything you would want to know about onions and no more. \n\nI love alliums, especially onions, and I got a kick out of the recipes. I’ve made and enjoyed some, but I haven’t worked up the courage to try Hemingway’s peanut butter and onion sandwich. \n\nAgreeable nonfiction, four stars by  Kurlansky standards. If you’re new to him, read Salt and Cod first. But if you like those, read this.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xf80b34f3a784ee22af3d552cac5869023795c189",
    "book_title": "The Name of the Rose",
    "book_author": "Umberto Eco",
    "text": "The Name of the Rose\n\nUmberto Eco puts Holmes and Watson into Monks’ robes and sets them up against a whodunit in a Medieval monastery. \n\nI got sick of mining “best books of <some criterion>” lists, because they all have some agenda to push. So I decided to look at the list of best selling books of all time and this stood out to me. The market can’t be that wrong, can it?\n\nNO, IT CANNOT. THE MARKET IS NEVER WRONG. \n\nAt least it wasn’t in this case. This was a delight. The plot is fun, the characters are human and balanced,  and the setting is a hoot. I don’t normally read mysteries, so this felt especially exotic to me. \n\nIf you liked The DaVinci Code, you will probably like this. But even if you disliked The DaVinci Code, you might like this, because it’s a much better book.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xf578a21d4ad2a1a84ec0e49e5936e54b05d145a1",
    "book_title": "Venice",
    "book_author": "Thomas F Madden",
    "text": "Venice \n\nThomas F Madden deftly conveys the peculiar history of Venice. \n\nTurns out it’s a lot more Byzantine than I expected, in all senses of that word. \n\nIt was effectively independent for much of its history, and its affiliations with the descendants of the Western Roman Empire and the descendants Eastern Roman Empire shifted often. It served as an interface for the two, and at times rose to the level of a peer. \n\nI also discovered, reading this book, that they beat the west to the punch on an early version of republican government. \n\nExhaustively researched, well told, and brimming with novel information. \n\nFour stars in a highly competitive class, strongly recommended.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xc15af1e9b3fe6702b16a9c6f5785084c293f3a4f",
    "book_title": "The Medici",
    "book_author": "Paul Strathern",
    "text": "The Medici\n\nPaul Strathern tells the story of the rise and fall of renaissance Italy’s greatest banking dynasty. \n\nI’d enjoyed Venice so much that I decided to pick another history book from @july’s list. It was even better. \n\nThere’s enough human drama and intrigue to rival Game of Thrones. The cast of characters is populated with demigods like Michelangelo, DaVinci, Galileo, and Machiavelli. \n\nAnd all throughout, you get a behind the scenes look at the Medicis pulling the strings. They were partly a product of the renaissance, but they were a core driver of its genesis as well. \n\nYou come to admire or at least respect the Medici so much over the first two acts that the decadence and decline in the third act is genuinely poignant. You feel a rewarding kind of self righteous disgust to see such a legacy squandered.\n\nIt’s a great story. It’s also a handbook on the things to do and not to do if you earnestly want to touch the lives of descendants you will never live to meet. \n\nFive stars, must read.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x5de94adb4726232b5247593a0ea4e8bb74f29b55",
    "book_title": "Sir Gawain and the Green Knight",
    "book_author": "Unknown",
    "text": "Sir Gawain and the Green Knight\n\nArthurian knight Gawain decapitates the green knight. The green knight collects his head and departs with a challenge to Gawain that sets him on a quest. \n\nMy boys and I listened to the Simon Armitage translation on Simon Sarris’s recommendation. It does a great job conveying the lilting alliterative verse of the opaque original Middle English version. \n\nThe language is hypnotic to the extent that the story doesn’t have to carry much weight for young listeners. If you’ve ever read Chicka Chicka Boom Boom to a 1yo, you know what I mean. \n\nBut the story holds up, though it feels bizarre and very foreign. \n\nIf you’re ever in the mood for something short and way out of the ordinary, this will fit the bill. \n\nFeeling fair, I favor it with four stars for fanciful flowing fiction.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xcad886c4493a8ad146f79305fddbac5123993758",
    "book_title": "Beowulf",
    "book_author": "Unknown",
    "text": "Beowulf\n\nThe eponymous character bails Hrothgar out of his trouble with Grendel. Grendel’s mom comes back at him swinging hard, but all Beowulf does is win, so they make him king. Much later, old man Beowulf dies fighting a dragon, though team Beowulf eventually secures the W. \n\nIt’s a bedrock story, the mythical foundation on which a lot of our modern fantasy rests. It’s also surprisingly palatable for modern audiences. Lindy for good reason. \n\nThe story is compelling enough that you don’t need to burn too many calories finding the ideal translation. It’s also pretty short, so it’s not like you’re making a huge commitment. \n\nIt reminded me of the Rohan scenes in LOTR. If you like fantasy or mythology, you should read it.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x952359a062027f5c2cc10fe241ee0561f3a31585",
    "book_title": "All Quiet on the Western Front",
    "book_author": "Ernst Remarque",
    "text": "All Quiet on the Western Front\n\nRemarque shows in livid detail how bad war is for a soldier.\n\nSynopsis:\n\nI’m excited for war, but wait, actually it’s bad. Bad bad bad bad bad. Miserable. Bad bad bad. Grotesque. Bad. Crippling. Bad. Bad. Bad. We eat a stolen goose! Bad. All my friends are dead.\n\nIt’s an unflinching rendition of what has since become a familiar pattern: wide eyed boy ships out eager and then discovers through extensive firsthand misery that death and pain flavor his war experience much more than glory and adventure.\n\nBut it’s mostly a one note symphony. It ignores that some moments might be exciting or meaningful (see War by Sebastian Junger) and it doesn’t plumb the emotional depths of its protagonist in interesting ways like Red Badge of Courage does. It runs its protagonist through a gauntlet of traumatic experiences and leaves the reader to imagine the resulting feelings.\n\nMore realistic than its ancestors? Yes. But not all it’s cracked up to be and since outpaced.\n\nThree stars.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xccc0c501764a67238fb9edbf4f742ae64371c3d0",
    "book_title": "King Solomon’s Mines",
    "book_author": "African El Dorado",
    "text": "King Solomon’s Mines\n\nHaggard’s story about an African El Dorado invents the lost world genre.\n\nIf this is the only book in the cottage and the storm raging outside prevents the boat from carrying you back to the mainland from the Outer Hebrides, then read it by candlelight.\n\nOtherwise, skip it.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x3d278c5385fbbcf2567f463d1efb8498f399d094",
    "book_title": "Plutarch’s Lives",
    "book_author": "Plutarch",
    "text": "Plutarch’s Lives\n\nI only read four of the fortyish biographies, but I counted it on my list because they’re all isolated and the four amounted to book length. \n\nThe two historical figures, Cicero and Marc Antony, were presented in a different light than I’d seen them in before. The two mythological figures received more familiar treatment, but in greater detail. \n\nI’ll definitely return to this. It’s great for those of us who think about the Roman Empire every day.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x6fcb5da22a0eeed342ccecdce6449159e31affd6",
    "book_title": "Tarzan of the Apes",
    "book_author": "H. Rider Haggard",
    "text": "Tarzan of the Apes\n\nCapable boy raised by apes grows into a man, rescues some marooned travelers. \n\nSome cultural avenues have been so long extended and so well trodden by Hollywood that returning to their origins produces a feeling of novelty that exceeds what one experiences in genuinely exotic territory. \n\nThe earnestness and naïveté of this book, as it discovers lately exhausted characters, themes, and plots has a charm of its own. But it’s also a fun, if anachronistically innocent, adventure story in itself. \n\nTarzan is a lovable character. The book version of the character is smart, in addition to being a capable vine swinger. You root for him with Jane like you’d root for a hapless nephew going to his first school dance.\n\nThis was good enough that, after reading it on my own, I put it into the queue of books to read with my kids.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x5979af84f7ab23a2f466364f913da804aec3261b",
    "book_title": "Two Years before the Mast",
    "book_author": "Herman Melville",
    "text": "Two Years before the Mast\n\nHarvard kid ships out with a merchant and learns the ropes. He goes to San Francisco, then a settlement of a few adobe structures, to trade.\n\nI am grateful to @links for putting this gem on my radar. It’s exactly on point for me:\n\n- erudite narrator\n- sea adventure \n- accounts of places I know in times I don’t \n\nThe book assumes that its reader is intelligent and patient, and gives a corresponding level of detail, but never enough to exhaust the reader. \n\nThis book clearly inspired Moby Dick, Captains Courageous, the Aubrey Maturin series, and others. You can smell the brine on it. \n\nBut it’s not all nautical. The middle section introduces the reader to the California coast back when SF, LA, and SD all had populations well below 1000. Their main export in those days was cowhide, and we learn the travails of buying, processing, and transporting them. \n\nIt’s also packed with great characters and fun tangential anecdotes. \n\nFive stars, banger.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x553ed0fd976963bb71f0225aebb43e92b496a16d",
    "book_title": "Strange Case of Dr Jekyll and Mr Hyde",
    "book_author": "Robert Louis Stevenson",
    "text": "Strange Case of Dr Jekyll and Mr Hyde\n\nRespectable Dr Jekyll loses the battle against his dark alter ego Mr Hyde. \n\nIf you’re into gothic horror, which is to say horror where nothing actually scary or horrifying happens, then you should read this. It’ll only take you a couple hours. \n\nOtherwise, you can probably just remain content with your familiarity with the Jekyll/Hyde dichotomy. \n\nDo not, like me, make the mistake of reading this book with the expectation of finding something more nuanced or interesting than that. There’s no fun adventure and the twist, such as it is, has no extra punch in the context of the full work. \n\nEminently skippable.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x2d1871dd16cb357a9120caf8857b8ca6fa6b47dc",
    "book_title": "The Long Goodbye",
    "book_author": "Dashiell Hammett",
    "text": "The Long Goodbye \n\nPrivate detective stubbornly tries to untangle the sordid affairs of an interconnected set of affluent LA-centric degenerates. \n\nLong indeed. And I was relieved to say goodbye. I never got deeply invested in anyone, even Marlowe. And the convoluted plot didn’t do it for me. \n\nEven the infinitely cool vibe of this kind of character and setting, that we know and love from the film noir expressions of the genre, didn’t come through for me. \n\nInstead, it just felt cold, flat, distant and dull, with an occasional whiplash inducing twist. \n\nMarlowe’s conscience and emotional core were even harder to build mental models for than they are in a movie like The Big Sleep. I just can’t reach the hows and whys. I can’t harmonize the rough surface with the heart of gold. \n\nAt the end of the day, I think this kind of story just wants to be a movie more than it wants to be a novel.\n\nNot recommended. But take it with a grain of salt, because I rarely enjoy detective novels.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x7babea7a4b1afad1bccbf49e186be89984422e64",
    "book_title": "This Boy’s Life",
    "book_author": "Donna Tartt",
    "text": "This Boy’s Life\n\nWolff recalls growing up badly behaved in bad circumstances. \n\nEven if you don’t like the merciless self deprecatory character development, you will find yourself engrossed in the stories. They are, for the most part, good stories. And they are uniformly well told. \n\nReading this book feels a lot more like reading a Bildungsroman than a memoir. He’s almost too writerly for the genre. Think: when you see a shot in a documentary that’s so well composed that it breaks the illusion of immediacy and makes you remember you’re watching a movie. \n\nAs long as you’re the type of reader who can abide an unloveable protagonist, you should read this book. It’s not worth dropping everything to chase down a copy, but if you liked Angela’s Ashes and The Glass Castle, you will like this (though not as much as those).",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x214c3e0cd743cfedac4456a719f380b5aeb53453",
    "book_title": "Kiki’s Delivery Service",
    "book_author": "Eiko Kadono",
    "text": "Kiki’s Delivery Service \n\nYoung witch sets out on her own. \n\nYou know how sometimes you Ghiblify a mediocre picture and it turns out amazing? That’s what we’ve got here. \n\nIt’s a top 3 Miyazaki movie for me, so when my 6yo picked it I was psyched. And we’d read and loved Howl’s Moving Castle. \n\nBut it turns out that the vast majority of the magic of the movie was added by Ghibli. The book was flat, dull, and childishly simple in comparison. \n\nI didn’t enjoy it. My 6yo did, but not as much as Coraline or The Ocean at the End of the Lane.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xf8bf184d95f9e286752c8076a03cbd965ca6112d",
    "book_title": "Strange Glow",
    "book_author": "John G. Kemeny",
    "text": "Strange Glow\n\nA measured, balanced, data driven look at the history, costs, and benefits of radiation. \n\nI asked my dentist for a book recommendation and he suggested this. It turned out to be a great read. \n\nA lot of it is science history, which I always love. \n\nThe last third or so weighs the benefits and risks of therapeutic and diagnostic radiation. \n\nIf your broken ulna is sticking out of the skin, don’t bother with the X ray. If it’s barely bruised, same. But the clarity you get from the X ray pays for itself if it allows the doctor to determine whether you need a cast. That kind of thing. Turns out mammograms might have only marginal benefit, if any, all things considered. \n\nGood for anyone interested in the history and health impacts of radiation. \n\nAnd of course, the radium girls make an appearance. \n\nStrongly recommended!",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xedd294d85b2589ba8b425aa97ecbefe8cc5ff948",
    "book_title": "Life",
    "book_author": "Keith Richards",
    "text": "Life\n\nKeith Richards tells his story with humor and aplomb.\n\nAnyone who’s been successful in the arts for so long or negotiated a fragile contract with substances for so long is going to have an interesting story. \n\nAs you’d expect, Keith Richards has an interesting story. \n\nWhat you might not expect is how well told it is. He’s smarter, more sensitive, and wiser than I would have guessed. And his ghost writer let Keith’s voice shine through in an authentic way, so the whole thing sounds right. \n\nYou get stories of boyhood, of the rise to fame, of substance abuse, of and of intra-band drama. And a whole lot of deep love for music. \n\nIt’s pretty much pitch perfect. Even if you don’t like the man’s music, it’s just a great book. \n\nAnd incredibly, for all that hard living, you get a happy ending. Aside from the occasional fall out of a palm tree or off a bookshelf, he has a nice, fairly mellow life now. He reads a lot, and shouts out the Aubrey-Maturin series, one of my favorites. \n\nCan’t miss.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x8a2e9fb955598674e0a7947bdf93b157e1791e4b",
    "book_title": "Captains Courageous",
    "book_author": "W. D. Howells",
    "text": "Captains Courageous \n\nUltra rich kid rescued from North Atlantic by cod fishermen, forced to work for months, receives enough routine psychological wear and tear to grow into a man. \n\nIt’s all so optimistic, sincere, well intentioned that I found it easy to forgive the trite parts. Good medicine for kids and tweens. Nearly but not entirely entertaining enough to hold their interest. \n\nRead it to your kids if you can, but only if they already love books. Otherwise read whatever they love until you’ve clinched the habit. My boys were neutral to it. \n\nNot the kind of thing any adult should read independently.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x9e24292dda3a98ad2c52d33b294a0679128df39a",
    "book_title": "Bulfinch’s Mythology",
    "book_author": "Thomas Bulfinch",
    "text": "Bulfinch’s Mythology\n\nEminently digestible and sanitized rendition of classical myths. \n\nEven with some of the juice robbed out of them, these are timeless and entertaining tales. \n\nI strongly encourage you to read mythology, especially Greek and Roman. Read every version you get your hands on until you can’t keep them all straight and you can’t help but create your own version when you tell it aloud to your friends and family. \n\nThere’s nothing as Lindy. Try allocating even 5-10% of your reading time to myths for a while and see if they don’t claim proportionally more mental real estate. \n\nStart with a direct translation of the Homeric Hymns or Metamorphoses and branch out from there.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xabd2a99a20ad34a4448a3cddf7cb877ac8ab09cf",
    "book_title": "The Aeneid",
    "book_author": "Quintus Ennius",
    "text": "The Aeneid\n\nAeneas travels from fallen Troy to Italy, fights a war, and founds Rome. \n\nThe underlying story is exactly on point for me, but the Robert Fagles translation didn’t quite hit the spot. \n\nAnyone have a favorite translation? I’d like to give it another shot.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x2898f53566476118f6f480270a219cf3ee85ef1a",
    "book_title": "Showdown on the Hogback",
    "book_author": "John Dos Passos",
    "text": "Showdown on the Hogback\n\nA smart, tough gunslinger gets hired to drive some lowlife squatters off a patch of desert, but when he discovers they’re really hardworking families, he flips sides to help defend them. \n\nThe space in the public consciousness for guilty pleasure novels for men seems to shrink even more rapidly than it does for women.  Louis L’amour is a good deal better than many of the other writers who served the niche during its heyday, but it’s hard to imagine that his work will survive many more generations. \n\nIt’s the kind of book that a guy might have stuffed in his pocket to read on the subway or kept on the bedside table to wind down with at night. In other words, it filled the role that doomscrolling on social media does now. \n\nAnd in the competition for attention, it’s no fight at all. Like a colt revolver against a tomahawk missle. But a lot of our experience is downstream of our information intake, and you should consider flipping sides and fighting for the good guys sometimes.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x1b615ecf700342c5a622a760c535bf957e64899d",
    "book_title": "Endurance",
    "book_author": "Ernest Shackleton",
    "text": "Endurance \n\nTrue story of Shackleton leading his men to safety after losing their ship in Antarctic latitudes. \n\nIt’s one of the all time great true survival stories. The crew spent over a year stranded on ice floes and desolate islands, hunted seals and penguins for food, and crossed the infamous Drake Passage in an open boat. \n\nAcross all that, no lives were lost, only a couple frostbite amputations were necessary, and if Lansing is to be believed, morale never even got too bad. \n\nThe detail of the physical trials and privations makes the environment come alive, and the steady stream of stories of minor interpersonal conflicts provide a convincing social context. \n\nGreat research, very good writing, and a remarkable story. I can’t wait until I can ask ChatGPT to make a feature film of this in the style of Master and Commander 😆\n\nThanks to @links for reminding me about it. \n\nHighly recommended for kids and adults.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x6032d29427da144a230a3b66064428c41f31e706",
    "book_title": "Middlemarch",
    "book_author": "E.M. Forster",
    "text": "Middlemarch\n\nHigh resolution realistic portrayal of provincial England in the early 19th century.\n\nMiddlemarch is to Jane Austen’s work as The Breakfast Club is to Clueless. In other words, it’s a good deal more substantial, nuanced, and empathetic. Plus, it tackles a broader and more serious range of subjects.\n\nThe times, places, language, manners, and values are all clearly drawn from the same pool. But beneath the superficially similar textures, the bones are radically different.\n\nOver the course of the novel, you get to know the strengths and flaws of a whole bunch of characters, and you come to feel deeply for even those with more flaws than strengths.\n\nI love novels like this because they remind me that even among the insignificant people of podunk places, everyone’s experiencing life with an intensity that merits a massive epic novel.\n\nIt’s a lot of work to read, but it pays for itself along the way. Excellent book but daunting. Read it for sure if you like Jane Austen and are also smart",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xfe40600cf39fb8c83df0b4801fb20ac2b1a68596",
    "book_title": "D-Day",
    "book_author": "Stephen Ambrose",
    "text": "D-Day\n\nStephen Ambrose covers the D Day topic in detail and more broadly. \n\nIt’s more or less a superset of the information and stories from The Longest Day. I’d give a slight edge to Ryan’s work for storytelling and writing. Ryan’s prose is punchier and more journalistic. Ambrose’s will only seem a little flat in direct comparison, though. It’s still very good. \n\nBoth are incredible overall, and you can choose freely between the two based entirely on how many pages you want to read on the topic. \n\nI enjoyed them both so much that I’m currently reading Band of Brothers now. \n\nWell told war stories are as good as it gets. This is why our stick wielding ancestors learned language. \n\nHighest recommendation.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xdc677e729265e49cca1beb64a0813c0899530959",
    "book_title": "Band of Brothers",
    "book_author": " Cornelius Ryan",
    "text": "Band of Brothers \n\nThe book that inspired the series that follows a special military unit from D Day to VE Day.\n\nIf you’ve seen the series (you should!), you know almost exactly what to expect here. The show does a remarkably faithful job of translating the book to the screen. \n\nA lot of the key dialogue lines are quotes from the soldiers, and a lot of the most memorable narration is pulled verbatim from Ambrose. \n\nIf you haven’t experienced either, the series is so good that you can take your pick between reading the book or watching the show. If you already love the show, the book will be enjoyable but it won’t blow your mind. Better to go with the D Day book instead, which has the same feel but covers different ground. \n\n“‘Grandpa, were you a hero in the war?’ Grandpa said, ‘No. But I served in a company of heroes.’”\n\nIt brings me to the verge of tears every time. \n\nHighest recommendation. The definitive war story of the quintessential modern war. Magical from first to last.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x58f3b18ceb0054cf443f0edf85185baf18414c07",
    "book_title": "The Unreasonable Virtue of Fly Fishing",
    "book_author": "Mark Kurlansky",
    "text": "The Unreasonable Virtue of Fly Fishing\n\nMark Kurlansky does his signature exposition on fly fishing. \n\nIt’s mediocre compared to his other work. He’s not a serious fisherman, which grates on me. And his heart clearly wasn’t in this one. \n\nThere’s probably a Goldilocks zone where you could care enough about fly fishing to be interested but not so much that this seems shallow and inartful. \n\nBut to be safe, I’m not recommending this to anyone. \n\nI love Kurlansky and I love fly fishing. Such a bummer that this was not good. \n\nMy parents got me it for Christmas and have followed up about it multiple times or I would not have even finished it. In case they ever find this:\n\nHi mom! 👋",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x9efd303127fcb8f496c5236c2983f2cff1c3209d",
    "book_title": "The Bible",
    "book_author": "Bible",
    "text": "The Bible\n\nFoundational text of Christianity. \n\nA lot of my favorite writers were quite fond of this book either for its substance or its poetry, or both. So I went into it not just with an open mind, but actively seeking the magic that so many serious people have found in it for so many centuries. \n\nI did not find much of anything remarkable. What I discovered instead is that Christianity as it’s commonly known is substantially extra-textual and the Judeo-Christian literary heritage is a product of layering by subsequent authors.\n\nThe Bible itself, as a literary work, does not offer much. It has its moments. The Song of Solomon stood out to me, for example. But if you throw that much at the wall something is bound to stick. It seemed to me that most of the Old Testament consisted of measurements in cubits for the construction of various sacred objects. \n\nThe New Testament at least emphasizes love and mercy, but in a simplistic way. No really touching moments.\n\nNot inspiring, not beautiful, not recommended.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x9b5cf76cf8522575fabc9f033a4915d3776a33ed",
    "book_title": "21 Cup",
    "book_author": "Mark Kurlansky",
    "text": "21 Cup\n\nPrecise exposition of the rules for a variant of beer pong.\n\nSome games have virtually no stakes and are played for the mere joy of playing. Some games are high stakes and require very precise definitions of acceptable play.\n\nBeer pong falls squarely into the former category, but when it becomes a cherished ritual among a set of bright, intense young people overflowing with energy, you end up with a book like 21 Cup. With cheer and humor, it gives a self consciously thorough and serious enumeration of the rules of the game.\n\nOne of my favorite parts of reading is modeling the mental state of the author at the time of writing. Between its dry, legalistic lines, 21 Cup tells a tacit story of a tribe of young men, flush with the power, joy, and optimism of their early twenties, bonding over the love of a simple game, which really just serves as a vessel for their mutual respect, fondness, and admiration.\n\nRecommended for anyone whose life includes a warmly remembered beer pong chapter.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xe8db0d056250688bd3933adefababcb8d2f76c88",
    "book_title": "Women",
    "book_author": "Charles Bukowski",
    "text": "Women\n\nBukowski kisses and tells.\n\nI read this as a palette cleanser between the Bible and the Quran. I remember loving Bukowski’ prose, perspective, and subject matter in my early twenties. \n\nBut this was a serious letdown. The writing was raw and direct, but not as potent as I recalled. The whole thing just came off as misogynistic and mildly pornographic. The only grasps at a higher literary tier were the occasional references to poetry readings, the broader misanthropy, and the revealed self loathing. \n\nI want to make it clear that I am not a prude. I understand desire. I feel desire strongly. I like writing that authentically conveys desire. But Bukowski’s thoughts and behaviors as recorded here seem more like deliberately hostile consumption than the aching, yearning, worshipping experience of desire that makes sense and feels right to me.\n\nI recommended avoiding this. If you want to read a filthy old man’s writings about sex, read Memories of my Melancholy Whores instead.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xe64a5d3d85f376f7d0c91b6f06de035179d5b401",
    "book_title": "The Caine Mutiny",
    "book_author": " Herman Melville",
    "text": "The Caine Mutiny\n\nCivilian becomes a captain of a minesweeper over the course of WWII. \n\n“The Navy is a master plan designed by geniuses for execution by idiots.”\n\nThe pain of coming to grips with this reality lies at the core of this book. The passably smart, reasonably independently thinking protagonist struggles with the dilemma, sometimes discarding his own rational reactions to formalistic bureaucratic nonsense and sometimes recoiling so strongly that he can’t help but reject the system level demands imposed by the distant geniuses. \n\nThe court martial concerning the mutiny mentioned in the title is usually referred to as the dramatic climax, but the post mortem delivered by the conflicted defense attorney afterwards was, for me, by far the best scene. \n\nOther than one slow section near the middle, the whole book is outstanding. It feels grown up and sophisticated without being daunting or fatiguing.\n\nHighly recommended. Lots of fun and full of insights applicable to any bureaucracy.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x926d182ad5d6bd32e37ce68c2301df65501d1216",
    "book_title": "Darkness at Noon",
    "book_author": "Arthur Koestler",
    "text": "Darkness at Noon\n\nFormer Soviet Party superstar languishes in prison while awaiting execution by the Soviets. \n\nNot recommended. \n\nThese people are just the worst. The book is largely an assertion along the lines of “us old Bolsheviks were making good progress toward trying real communism and then these Stalinist thugs came and ruined it.”\n\nWhich is, of course, stupid on its face. \n\nSoviet thinking had all the worst vices of religious thinking and none of its virtues. It’s so exhausting to listen to the performative rhetoric competition. “How far can I distort my worldview? Did you distort your worldview enough to escape the KGB death squads?”\n\nThere’s pretty much nothing else to this book. \n\nWarning: I’m going to block anyone who shows up in the replies defending any flavor of Marxism, Bolshevism, Stalinism, etc.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x634e2ee8b792038194279c054fa0cfa87fc36554",
    "book_title": "The Courage to Be Disliked",
    "book_author": "John C. Dialogue",
    "text": "The Courage to Be Disliked\n\nDialogue lays out the fundamentals of Adlerian psychology as the most effective self help strategy.\n\nThe title is so good, the book has tons of sales, the reviews were glowing, and the connection to Japanese culture was so tantalizing. But the book turned out to be just one of the many dime-a-dozen self help books that grab onto some specific mode of psychology and tell you to stop worrying because now you have their special insight. \n\nIf you’re a troubled teenager, go for it. Or for any of its near clones. Otherwise, skip it.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x995dd027958f6982267c0173c15de9042a870a87",
    "book_title": "The Cruel Sea",
    "book_author": "John C. Dialogue",
    "text": "The Cruel Sea\n\nNovel about a group of UK men serving on an escort ship in the Atlantic during WWII. \n\nOutstanding book. It’s split about 60/40 between sea related narrative and the lives of the men as men. \n\nThe horrors of war are presented unflinchingly, but faced with that famous Anglo Saxon stiff upper lip. The pride of service, the sense of duty, and the onboard camaraderie counterbalance the misery of fighting the elements and the enemy. \n\nThe stories of the men’s lives on shore were particularly good and surprisingly honest given the book’s age. One character falls in love, fathers a child out of wedlock, receives a letter while abroad that the mother intends to abort it, and replies that she should keep it. A few days later he learns that she’d been killed before he even got her letter. Touching stuff and written with deep empathy. \n\nI’m surprised this book isn’t talked about more. Recommended generally. Strongly recommended for fans of war stories.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x151346cbf04a7fb72fcce685ad62fd7c03c2b446",
    "book_title": "But fabulous",
    "book_author": "John C. Dialogue",
    "text": "But fabulous \n\nhttps://www.cabinetmagazine.org/issues/25/duprat.php",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x8664e7adc9c051fed25df9a4d4f9922b830c71e9",
    "book_title": "Fire",
    "book_author": "Sebastian Junger",
    "text": "Fire\n\nSebastian Junger covers a set of disparate topics, unified by their danger. \n\nIt’s not a coherent, focused look at one thing, which is a minor demerit. But it beats the alternative of tracking down a bunch of National Geographic magazines just to read his work. \n\nThe stories about Kosovo, escaping captivity, forest fire fighters, and traditional whaling in the Caribbean stuck with me in particular. \n\nIt’s all ~25 years past the point of journalistic relevance, but the writing and storytelling is as good as ever. \n\nRecommended for fans of Junger, but if you’re not yet a fan, read his other stuff first, starting with The Perfect Storm and War.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x17249ec579c9cc7a8c3c588befd6e580aa4af311",
    "book_title": "Kim",
    "book_author": "Arthur Conan Doyle",
    "text": "Kim\n\nOrphan boy comes of age, studies under a spiritual mentor, and becomes a spy, all simultaneously. \n\nIt works as adventure story and as a snapshot of India around the start of the 20th century. It kind of works as a coming of age story. Its spiritual facet doesn’t shine like the others. \n\nI went in with high expectations based on descriptions and reviews, but it didn’t deliver quite like I hoped. Some parts felt cheesy and shallow. And the espionage intrigue never developed as fully as I was hoping. \n\nBut it’s undeniably fun just to take a tour through India in the late 1800s. \n\nI wouldn’t warn someone off if they wanted to read it. But I can’t think of an audience I’d actively recommend it to.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x9c057051d2c9a3c5df00e5ce9625c94f774fb4b3",
    "book_title": "Notes from Underground",
    "book_author": "Fyodor Dostoevsky",
    "text": "Notes from Underground\n\nBitter, spiteful, unreliable narrator absolutely drags rationality, determinism, and himself. \n\nThis is not a fun book. I did not enjoy reading it. The first half isn’t even a story, just a screed. The second half is a brutal portrait of the narrator as the worst kind of person.\n\nI’d be prepared to forgive all that if not for the fact that it didn’t even surface any especially novel or plausible ideas. \n\nIf you liked Crime and Punishment, this might appeal to you. But if you, like me, find yourself looking for Dostoevsky titles because you loved The Brothers Karamazov, look elsewhere.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x2e28df69680976156598af2ee0e929f3e2b8d9f1",
    "book_title": "Ethan Frome",
    "book_author": "Edgar Allan Poe",
    "text": "Ethan Frome\n\nEthan falls in love with Mattie, the cousin of his miserable wife, to disastrous results. \n\nIt’s a lovely, tender, tight little book. It’s faithful and fair to both the strict social norms of its setting and the feelings that provide the impetus for their transgression. \n\nWhile Ethan’s wife Zeena is a bit less complex than Ethan and Mattie, her unflattering portrait is perhaps the most memorable of all. But across the board the character development is terrific. \n\nYou also get an uncommonly strong sense of place from the book. If you’ve ever experienced the northeastern United States in the winter, it’ll make you reach for your warmest coat. \n\nIt’s the opposite of flashy. It lacks the garish gestures that characterize modern romance stories, and it ends in tragedy. But despite all that, in its understated way, it’s one of the most romantic books I’ve ever read. Despite all the physical and emotional frigidity, it’s kinda hot. \n\nHighly recommended.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x541b90c4d869e37a6216571c0078044bbef1b6b4",
    "book_title": "My Antonia",
    "book_author": "Willa Cather",
    "text": "My Antonia\n\nLoving portrait of a young immigrant girl growing into adulthood on the frontier.\n\nThe narrator is an orphan who moves to the frontier around the same time as Antonia, and falls in love with her. You will, too. She’s tough, charming, and overflowing with life. \n\nThe book is also a portrait of Antonia’s time, place, and people. It works well on all those fronts as well. Wonderful anecdotes, wonderful characters.\n\nThe prose leaned more poetic than was good for it at times, but that’s my only quibble. \n\nReading this felt like being initiated into something secret and beautiful. I love this kind of love. \n\nRecommended for anyone.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xaba99a4a5018445e68e54ae2ca171e2be2a4ba8b",
    "book_title": "Lord Jim",
    "book_author": "Herman Melville",
    "text": "Lord Jim\n\nYoung Jim, who is not really a lord of any sort, grapples with his past. \n\nYou can flip this book open to any page, read a few paragraphs, and know you’re reading good writing. But if you don’t keep your head in the game, the entire book will feel like that. \n\nThe narrative structure is not ergonomic, and the majority of book kind of obliquely looks at its actual subject. So it’s not an easy read. \n\nBut Conrad is a master at conjuring a mood, and if you put in the work that this book asks of you, you’ll find a meaningful coherence beneath its seemingly disjointed narrative. Worst case, it’s a bunch of compelling short stories. \n\nDon’t run to the library this moment, but if you get a chance to read it, don’t turn it down. Cautiously recommended.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x9814ac10da22b007c1a5e29a89ed1b2dced18b1b",
    "book_title": "A River Runs Through It",
    "book_author": " Norman Maclean",
    "text": "A River Runs Through It\n\nA family of fly fishermen lose a brother. \n\nThis is the best fishing book. And it’s also a beautifully written piece of literature, even for those who don’t fish. \n\nI’ve read maybe a dozen fishing books, and with the exception of John Gierach’s books, I’ve found them all at least a little off putting as a consequence of the authors’ varying degrees of poseur. Most were filthy casuals, even those who purported to be dedicated or addicted.\n\nNorman Maclean is the real thing. He’s a true fisherman. It matters to me, but only because of that Gell-Mann amnesia effect. \n\nWhat will matter to many more is that he’s also an outstanding writer and storyteller. He writes with humor and poetry, but always stays grounded. \n\nI held off reading this because I love the movie and I didn’t want a sub par book to compromise my enjoyment. Far from it, turned out. \n\nRecommended for everyone. Highly recommended for anyone who fishes or loves someone who fishes.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xa11f12d814ef25e8360cac8672d817afc6cbe8fc",
    "book_title": "Born Standing Up",
    "book_author": "Bill Burr",
    "text": "Born Standing Up\n\nComedy legend briefly tells his story from birth to the top.\n\nIt’s a treat. He’s smart, sincere, and sensitive throughout, which took me slightly by surprise since he so often plays the opposite type of character.\n\nBut it’s never heavy handed, and it offers its fair share of laughs, too.\n\nAnother great example of someone grinding for decades to earn overnight success. \n\nRecommended for all. Would make a great plane, train, or beach book.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xc57df6a461b336a5ab48d9374b6b4e944ddf895c",
    "book_title": "Our Man in Havana",
    "book_author": "John le Carré",
    "text": "Our Man in Havana\n\nBritish expat recruited as a spy in pre-revolution Cuba, takes the gig for the money, dark hijinks ensue. \n\nThe 2025 film adaptation would be directed by the Coen Brothers. The whole vibe feels a lot like a tropical version of Burn After Reading. \n\nIt was fun and entertaining, with a bit more meat on its bones than a pure bubblegum spy thriller. Also more self aware and humorous. \n\nCasually recommended if you’re looking for something in its niche.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x492e330dfab1b5fd1d63d3a7583dbf9b46b1312e",
    "book_title": "Me Talk Pretty One Day",
    "book_author": "H.L. Mencken",
    "text": "Me Talk Pretty One Day\n\nHilarious writer does a couple dozen bits. \n\nThere are no great ideas to be mined. There’s no coherent thesis. It’s not a Great Book. \n\nBut it is a great book, and it made me laugh out loud a bunch of times. Lots of fun. \n\nRecommended.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xabfefa06125b9e061f9ff763414a77acda4284a0",
    "book_title": "Hitchhiker’s Guide to the Galaxy",
    "book_author": "Douglas Adams",
    "text": "Hitchhiker’s Guide to the Galaxy\n\nArthur Dent narrowly survives the end of the world, then things get tough. \n\nIf you like sci fi but haven’t read this, you absolutely must. There’s a chance you won’t like it, but it’s more likely that you’ll love it. \n\nThe plot is pretty manic and disjointed, and there’s not a lot of character development in the traditional sense, thought there are a lot of memorable personalities. \n\nIt’s really just a vehicle for a whole bunch of hilarious lines. And it roasts sci-fi with obvious love. \n\nI laughed out loud when I read it the first time. My 6yo and I laughed out loud on this pass.\n\nStrongly recommended for fans of sci-fi and humor. And for anglophiles, too, now that I think of it.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xbe6c1d714fd25ae24ccdb621b120c4f58c056da3",
    "book_title": "Delta-v",
    "book_author": "Alfred Bester",
    "text": "Delta-v\n\nNear future tale of commercial deep space asteroid mining.\n\nIt takes its time getting up to speed, but once it hits its stride, it’s a lot of fun. \n\nThis book hit my radar in the course of a conversation with July about the practical realities of space commerce. Like that exposition, this book is gratifyingly grounded in both physics and economics. Reading this book or talking with July, you get the feeling that this kind of thing is achievable and all that’s missing is imagination, will, and a few billion dollars in funding. \n\nMy main gripe with the book is that entirely too much time was allocated to Rochat the space lawyer. His chapters felt bland compared to those of Tighe the protagonist. Suarez could use a better, more persuasive editor. \n\nBut it’s worth it to go with Tighe and his smart, tough, high agency friends on an adventure into deep space. \n\nRecommended for fans of sci-fi, especially grounded, near future sci-fi. But also for anyone who enjoys Chricton style adventures.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x495fdb8a59ab5444ba2983e22027cc7c9d1df184",
    "book_title": "Sons and Lovers",
    "book_author": "D.H. Lawrence",
    "text": "Sons and Lovers\n\nA young man works through relationships with the women in his life.\n\nThis book lands right in the sweet spot for me. It's ahead of its time, so it's open and direct about the stuff that goes on in the lives of real people. But it's old enough that it's not burdened with all the goofy affectations of modernism.\n\nThe prose is strong, it's not shy about its subjects, and the characters are deeply and lovingly portrayed. It feels fresh, vibrant, authentic, and accessible even a century and change after it was written. I will never get tired of reading stories about people and their relationships.\n\nStrongly recommended for all.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x7a65e4124489bc1bb570044b61eb86efec21dc5e",
    "book_title": "Peter Pan",
    "book_author": "J.M. Barrie",
    "text": "Peter Pan\n\nThe original adventure to Neverland.\n\nI read the play hoping for surprises, but the old Disney movie does a faithful enough job that nothing stood out.\n\nIt’s an ecstatic fever dream of a story and Peter Pan is a timeless character.\n\nWatch the cartoon and watch Hook. It’s more on brand for this content.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x16fc116a9d8f84c3b5ddfafc3afc19bf913312db",
    "book_title": "Grendel",
    "book_author": "B. M. S. Anderson",
    "text": "Grendel\n\nA monster engages in a miserable, hyperactive intellectual inner life leading up to his encounter with Beowulf. \n\nI was expecting a more conventional story: “hey this monster is actually just a well intentioned but misunderstood character!”\n\nBut Grendel is doubly a monster here. He still devours men and beasts, but he’s also an intellectual monster, almost exactly a French existentialist. \n\nI really despise those guys, but somehow the whole schtick seemed more palatable packaged this way. \n\nMaking Grendel a sympathetic antihero is a mid tier achievement. Making existentialism tolerable is S tier. \n\nIt’s an impressive book, but I wouldn’t recommend it. Narrow exception for those who are into both Beowulf and ambivalent about existential philosophy.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x2a8092f47e1f11d22d5ea5bd9bc6dd6d0307dc87",
    "book_title": "The Kreutzer Sonata",
    "book_author": "Leo Tolstoy",
    "text": "The Kreutzer Sonata\n\nMisogynist recounts the story of killing his wife, delivering a polemic against desire along the way. \n\nThis was hard to square with the Tolstoy I know and love. Part of me still feels like it must be tongue in cheek and that the anti-love, anti-marriage, anti-desire screed is put into the mouth of a wife killer to discredit it. \n\nI violated one of my firm guidelines and looked up Tolstoy’s stated position on the matter. Seems like he meant it sincerely as an argument for chastity, and that he really believed the straightforward statement of Pozdnyshev’s position.\n\nLife is good. Love is good. Desire is good. This novella is bad. \n\nNot recommended for anyone.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xb68937a79ee5eea0f85d76941ccfa5200705aef8",
    "book_title": "Over Sea, Under Stone",
    "book_author": "Frances Hodgson Burnett",
    "text": "Over Sea, Under Stone \n\nThree kids and their uncle pursue the grail in Cornwall.\n\nThis is the first of a series known collectively as The Dark is Rising. It’s less fantasy and more adventure than the rest. \n\nThe writing is good, the story is good, it has layers for kids and adults. The connection to Arthurian legend gives it some nice British zest. My kids loved it. No complaints here. \n\nRecommended for reading to kids.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x9ab49f0c1916e501a5d21edb765e98d9b7e1db91",
    "book_title": "Pedro Paramo",
    "book_author": "Juan Rulfo",
    "text": "Pedro Paramo\n\nA man in search of his father visits a ghost town that turns out to be substantially populated actual dead people.\n\nI should have had a bigger reaction to this, given that I’m from the rust belt and I love books about death. The whole book is about the dead and dying in a declining Mexican village. \n\nBut a big part of what I find so interesting about death is its awesome terrible finality. And this book presents death as a permeable barrier. The spirit world interacts extensively and fluidly with the real world. And the narrative is nonlinear, which emphasizes the muddling of the life and death border. \n\nMostly it just made me crave another pass through 100 Years of Solitude. \n\nI tried reading this in Spanish but couldn’t hack it. It shook my confidence in my Spanish reading comprehension, but then I struggled to understand it in English, which reassured me a bit 😅\n\nOnly recommended if you’re addicted to magical realism and running low on supply.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xa4fbb1a043d1c18ee34531913876aa26412ab6e5",
    "book_title": "The Cossacks",
    "book_author": "L. N. Tolstoy",
    "text": "The Cossacks\n\nYoung aristocrat moves to the sticks to live awhile with some tough frontier people. \n\nIt’s a fun and exciting adventure, with all the usual Tolstoy depth and substance. My only complaint is that some of the philosophical tangents carry on long enough to disrupt the main narrative. \n\nThe protagonist is mostly just a vehicle for the aforementioned philosophy and for introducing us to the Cossacks. The Cossacks are the stars of the show, and they form a memorable ensemble. I especially liked Eroshka. \n\nRead Anna Karenina and War and Peace first, but don’t overlook this book.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0x2b5bc6f310e179f9c0ebd14f7fc814c7b1416711",
    "book_title": "Redwall",
    "book_author": "Bernd Moogk",
    "text": "Redwall \n\nGame of Thrones meets The Wind in the Willows; a young mouse goes on a quest to find ancient arms then uses them to vanquish terrible foes. \n\nThis is a book for kids. Adults should not read it on their own. But it’s probably better than a lot of the books you’ll read this year.\n\nThe book opens with one of the all time great feasts, which the author probably justified to the editor as an important technique for establishing that Redwall Abbey is a place of peace and security for the community. But clearly it’s mostly just an expression of Jacques’ exuberant and genuine love of food. \n\nFollowing hot on its heels, we meet Cluny the Scourge, leader of a horde of invaders and one of the book’s two great villains.\n\nThe hero Matthias seeks out the lost sword and shield of Martin the Warrior, the founder of Redwall Abbey. In the course of overcoming various obstacles, he meets and befriends the Sparra tribe and the Shrew tribe, and also slays Asmodeus, a giant magical snake monster. \n\nHe returns to the Abbey with a full complement of gear and a new sense of his own capabilities, and leads the forces of good to victory. His mentor dies in the assault, but Matthias gets the girl and the two have a son. \n\nThe story is timeless, the writing is good, the characters are quirky and lovable. The whole thing is incredibly well done. \n\nThis is one of my boys’ all time favorites and it’s one of the best kids’ books I’ve ever read. \n\nHighly recommended for 4-11 year olds.",
    "reason": "Book not found in OpenLibrary"
  },
  {
    "hash": "0xe510df5d3a21047afbc5627ca2de8b18663a36c9",
    "book_title": "Menu Design In America",
    "book_author": "Lindsey Stirling",
    "text": "Menu Design In America\n\nLots of gorgeous pictures of old menus with interesting writeups. \n\nFun because the design is so good, the menus are so surprising, and the nostalgia is so potent. \n\nHighly recommended coffee table book. \n\nI can’t quit you /books 😅",
    "reason": "Book not found in OpenLibrary"
  }
]